{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "simplified_embedding_network_two_inputs",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                1024,
                1
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "signal_input"
            },
            "name": "signal_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [
                7
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        1
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "signal_input",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv1d_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "relu_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "max_value": null,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "relu_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "batch_normalization_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [
                7
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "relu_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv1d_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_se_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling1d_se_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "batch_normalization_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_se_1_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 4,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_se_1_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "global_average_pooling1d_se_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_se_2_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 64,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_se_2_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        4
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "dense_se_1_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape_se_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "target_shape": [
                1,
                64
              ]
            },
            "name": "reshape_se_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "dense_se_2_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Multiply",
            "config": {
              "name": "multiply_se_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              }
            },
            "name": "multiply_se_0",
            "inbound_nodes": [
              {
                "args": [
                  [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          1024,
                          64
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "batch_normalization_1",
                          0,
                          0
                        ]
                      }
                    },
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          1,
                          64
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "reshape_se_0",
                          0,
                          0
                        ]
                      }
                    }
                  ]
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_res_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [
                1
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_res_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        1
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "signal_input",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              }
            },
            "name": "add_0",
            "inbound_nodes": [
              {
                "args": [
                  [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          1024,
                          64
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "multiply_se_0",
                          0,
                          0
                        ]
                      }
                    },
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          1024,
                          64
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "conv1d_res_0",
                          0,
                          0
                        ]
                      }
                    }
                  ]
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "relu_add_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "max_value": null,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "relu_add_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "add_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_0",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2
              ],
              "padding": "valid",
              "strides": [
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling1d_0",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        1024,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "relu_add_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [
                7
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_2",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "max_pooling1d_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv1d_2",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "relu_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "max_value": null,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "relu_2",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "batch_normalization_2",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [
                7
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_3",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "relu_2",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_3",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "conv1d_3",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_se_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling1d_se_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "batch_normalization_3",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {
                  "mask": null
                }
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_se_1_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 8,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_se_1_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "global_average_pooling1d_se_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_se_2_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 128,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_se_2_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        8
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "dense_se_1_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape_se_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "target_shape": [
                1,
                128
              ]
            },
            "name": "reshape_se_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "dense_se_2_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Multiply",
            "config": {
              "name": "multiply_se_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              }
            },
            "name": "multiply_se_1",
            "inbound_nodes": [
              {
                "args": [
                  [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          512,
                          128
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "batch_normalization_3",
                          0,
                          0
                        ]
                      }
                    },
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          1,
                          128
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "reshape_se_1",
                          0,
                          0
                        ]
                      }
                    }
                  ]
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_res_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [
                1
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_res_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        64
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "max_pooling1d_0",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              }
            },
            "name": "add_1",
            "inbound_nodes": [
              {
                "args": [
                  [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          512,
                          128
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "multiply_se_1",
                          0,
                          0
                        ]
                      }
                    },
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [
                          null,
                          512,
                          128
                        ],
                        "dtype": "float32",
                        "keras_history": [
                          "conv1d_res_1",
                          0,
                          0
                        ]
                      }
                    }
                  ]
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "relu_add_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "max_value": null,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "relu_add_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "add_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2
              ],
              "padding": "valid",
              "strides": [
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling1d_1",
            "inbound_nodes": [
              {
                "args": [
                  {
                    "class_name": "__keras_tensor__",
                    "config": {
                      "shape": [
                        null,
                        512,
                        128
                      ],
                      "dtype": "float32",
                      "keras_history": [
                        "relu_add_1",
                        0,
                        0
                      ]
                    }
                  }
                ],
                "kwargs": {}
              }
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_4",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 256,
